# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк

alice_in_wonderland = ('"Would you tell me, please, which way I ought to go from here?"\n'
                       '"That depends a good deal on where you want to get to," said the Cat.\n'
                       '"I don\'t much care where," said Alice.\n'
                       '"Then it doesn\'t matter which way you go," said the Cat.\n'
                       '"...so long as I get somewhere," Alice added as an explanation.\n'
                       '"Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."')

print("Tasks 1-3")
print(alice_in_wonderland)
"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
print("Task 4")
black_sea = 436402
azov_sea = 37800
total_seas = black_sea + azov_sea
print(f"Чорне та Азовське море разом займають {total_seas} км2.")

# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
print("Task 5")
warehouses_total = 375291
warehouse_1_2 = 250449
warehouse_2_3 = 222950
warehouse_3 = warehouses_total - warehouse_1_2
warehouse_1 = warehouses_total - warehouse_2_3
warehouse_2 = warehouse_1_2 - warehouse_1
print(f"На першому складі розташовано {warehouse_1} товарів, на другому - {warehouse_2}, а на третьому - {warehouse_3} товарів.")

# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
print("Task 6")
term = 18
amount = 1179
comp_cost = term * amount
print(f"Вартість комп’ютера {comp_cost} грн.")

# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
print("Task 7")
а = 8019 % 8
b = 9907 % 9
c = 2789 % 5
d = 7248 % 6
e = 7128 % 5
f = 19224 % 9
print(f"Остача від ділення"
      f" для 8019 : 8 це {а},"
      f" для 9907 : 9 це {b},",
      f" для 2789 : 5 це {c},",
      f" для 7248 : 6 це {d},",
      f" для 7128 : 5 це {e},",
      f" для 19224 : 9 це {f}")


# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
print("Task 8")
l_pizza_a = 4
l_pizza_p = 274
m_pizza_a = 2
m_pizza_p = 218
juice_a = 4
juice_p = 35
cake_a = 1
cake_p = 350
water_a = 3
water_p = 21
order = l_pizza_a * l_pizza_p + m_pizza_a * m_pizza_p + juice_a * juice_p + cake_a * cake_p + water_a * water_p
print(f"Іринці на її замовлення знадобиться {order} грн.")

# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
print("Task 9")
total = 232
max_amount = 8
pages = total // max_amount
if total % max_amount == 0:
    print(f"Ігорю знадобиться {pages} сторінок щоб вклеїти всі фото.")
else:
    print(f"Ігорю знадобиться {pages + 1} сторінок щоб вклеїти всі фото.")

# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
print("Task 10")
distance = 1600
fuel_expense = 0.09
max_fuel = 48
trip_fuel = distance * fuel_expense
print(f"1) Для такої подорожі знадобиться {int(trip_fuel)} літрів бензину.")
if trip_fuel % max_fuel == 0:
    print(f"2) Під час цієї подорожі родині необхідно заїхати на заправку щонайменше {int(trip_fuel // max_fuel)} "
          f"рази заправляючи повний бак якщо враховувати першу заправку в м. Харків на початку подорожі.")
else:
    print(f"2) Під час цієї подорожі родині необхідно заїхати на заправку щонайменше {int(trip_fuel // max_fuel + 1)}"
          f" рази заправляючи повний бакякщо враховувати першу заправку в м. Харків на початку подорожі.")
